__author__ = 'Лелянов Иван Александрович'


# 1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.
print('Задание 1')

n = int(input('Введите целое трехзначное число: '))
v1 = n // 100
v2 = n % 100 // 10
v3 = n % 10

print("Сумма цифр числа:", v1 + v2 + v3)
print("Произведение цифр числа:", v1 * v2 * v3)


# 3. По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b, проходящей через эти точки.
print('Задание 3')

print("Координаты точки A:")
x1 = float(input("x1 = "))
y1 = float(input("y1 = "))

print("Координаты точки B:")
x2 = float(input("x2 = "))
y2 = float(input("y2 = "))

k = (y1 - y2) / (x1 - x2)
b = y2 - k * x2
print("Уравнение прямой:")
print(f"y = {k}*x + {b}")


# 9. Вводятся три разных числа. Найти, какое из них является средним (больше одного, но меньше другого)
print('Задание 9')

print("Введите 3 разных числа:")
v1 = float(input("v1 = "))
v2 = float(input("v2 = "))
v3 = float(input("v3 = "))

if v2 < v1 < v3 or v2 > v1 > v3:
    print('Среднее:', v1)
elif v1 < v2 < v3 or v1 > v2 > v3:
    print('Среднее:', v2)
else:
    print('Среднее:', v3)


# 8. Определить, является ли год, который ввел пользователь, високосным или не високосным.
print('Задание 8')

year = int(input("Введите год: "))
if year % 4 != 0 or (year % 100 == 0 and year % 400 != 0):
    print("не високосный год")
else:
    print("високосный год")


# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
print('Задание 6')

n = int(input('Номер буквы в алфавите: '))
n = ord('a') + n - 1
print(f'Откройте букву {chr(n)}!')
print('Вы назовете слово или будите крутить барабан?')