# Посчитать, сколько раз встречается определенная цифра в введенной последовательности чисел.
# Количество вводимых чисел и цифра, которую необходимо посчитать, задаются вводом с клавиатуры.

print('Задание 8')

amountNumbers = int(input('Сколько чисел собрался вводить? '))
v = input('Введите искомую цифру: ')

n = 1
count = 0

while n <= amountNumbers:
    number = input(f'Введите {n} число: ')
    count += number.count(v)
    n += 1

print(f"Цифра '{v}' встретилась {count} раз")


